import os


class TextFunc:

    @staticmethod
    def translitezator(list_txt: list):
        # символы замен - что на что меняем
        legend = {
            '»': '_',
            '«': '_',
            '—': '_',
            ']': '_',
            '[': '_',
            '}': '_',
            '{': '_',
            '&': '_',
            ')': '_',
            '(': '_',
            '^': '_',
            '$': '_',
            '#': '_',
            '~': '_',
            '-': '_',
            '"': '_',
            '@': '_',
            '!': '_',
            '%': '_',
            '.': '_',
            '+': '_',
            '>': '_',
            '<': '_',
            '?': '_',
            '*': '_',
            '|': '_',
            ';': '_',
            ':': '_',
            '/': '_',
            '№': 'N',
            ' ': '_',
            ',': '',
            'а': 'a',
            'б': 'b',
            'в': 'v',
            'г': 'g',
            'д': 'd',
            'е': 'e',
            'ё': 'yo',
            'ж': 'zh',
            'з': 'z',
            'и': 'i',
            'й': 'y',
            'к': 'k',
            'л': 'l',
            'м': 'm',
            'н': 'n',
            'о': 'o',
            'п': 'p',
            'р': 'r',
            'с': 's',
            'т': 't',
            'у': 'u',
            'ф': 'f',
            'х': 'h',
            'ц': 'c',
            'ч': 'ch',
            'ш': 'sh',
            'щ': 'shch',
            'ъ': '',
            'ы': 'y',
            'ь': '',
            'э': 'e',
            'ю': 'yu',
            'я': 'ya',
            'А': 'A',
            'Б': 'B',
            'В': 'V',
            'Г': 'G',
            'Д': 'D',
            'Е': 'E',
            'Ё': 'Yo',
            'Ж': 'Zh',
            'З': 'Z',
            'И': 'I',
            'Й': 'Y',
            'К': 'K',
            'Л': 'L',
            'М': 'M',
            'Н': 'N',
            'О': 'O',
            'П': 'P',
            'Р': 'R',
            'С': 'S',
            'Т': 'T',
            'У': 'U',
            'Ф': 'F',
            'Х': 'H',
            'Ц': 'Ts',
            'Ч': 'Ch',
            'Ш': 'Sh',
            'Щ': 'Shch',
            'Ъ': '',
            'Ы': 'Y',
            'Ь': '',
            'Э': 'E',
            'Ю': 'Yu',
            'Я': 'Ya',
        }

        # инициируем словарь для результатов
        dict_for_replace = {}

        # цикл по каждой строке листа
        for old_name in list_txt:
            # до начала замены символов загоняем старое имя в новое (чтоб потом проверить изменения)
            file_new = old_name
            for i, j in legend.items():
                file_new = file_new.replace(i, j)

            while file_new.find("__") > 0:
                file_new = file_new.replace("__", "_")

            if file_new.endswith("_"):
                file_new = file_new[:-1]

            dict_for_replace[old_name] = file_new

        return dict_for_replace




# if file_old != file_new:
#     print('{0: <30}'.format(file_old), 'переименован в ', file_new)
#     os.rename((path + "\\" + file_old), (path + "\\" + file_new))